{
  "nav": {
    "home": "Home",
    "projects": "Progetti",
    "resume": "Curriculum",
    "calendar": "Calendario"
  },
  "common": {
    "name": "Balla Botond",
    "easterEggs": {
      "welcomeBack": "Ben tornato, intenditore",
      "patience": "La pazienza è una virtù"
    },
    "taglines": [
      "Trasformare Visione in Valore",
      "Ingegneria della Crescita su Scala",
      "Costruire le Soluzioni di Domani",
      "Dove Innovazione Incontra Impatto",
      "Risultati Attraverso la Tecnologia",
      "Architettare il Successo Sostenibile",
      "Precisione in Ogni Decisione",
      "Sistemi Strategici per il Business Moderno",
      "Creare Vantaggio Competitivo",
      "Eccellenza Attraverso l'Esecuzione"
    ],
    "subtitle": "Creatore e Innovatore",
    "email": "Email",
    "github": "GitHub",
    "facebook": "Facebook",
    "instagram": "Instagram",
    "youtube": "YouTube",
    "twitter": "X (Twitter)",
    "signal": "Signal",
    "linkedin": "LinkedIn",
    "coffee": "Offrimi un caffè"
  },
  "home": {
    "title": "Balla Botond",
    "description": "Balla Botond - Sviluppatore e creatore con una passione per soluzioni costruite con cura e dal fascino senza tempo. Esplora i miei progetti, connettiti sui social media e scopri il mio lavoro nello sviluppo e nell'innovazione.",
    "keywords": "Balla Botond, Botond Balla, sviluppatore, trackit, sviluppatore software, sviluppatore web, sito personale, portfolio, bllbtnd, programmazione, innovazione, Ungheria, tech, progetti, GitHub, Boti, Balla Boti",
    "bio": "Con un approccio esigente sia al lavoro che al tempo libero, gravito verso esperienze e soluzioni che sono costruite con cura e hanno un fascino senza tempo. I miei progetti riflettono un rispetto per i metodi consolidati, bilanciato con una spinta per l'innovazione e la precisione. Trovo ispirazione nella maestria dietro le cose ben fatte - che si tratti della struttura di un'applicazione robusta, delle note stratificate di uno scotch raro, o del gioco di luce e ombra. Per me, la qualità non è mai accidentale; è il risultato di intenzione, cura e un apprezzamento per i dettagli che resistono alla prova del tempo.",
    "available": "Disponibile",
    "busy": "Occupato"
  },
  "movies": {
    "title": "Valutazioni Film",
    "description": "Le mie cronache cinematografiche personali"
  },
  "calendar": {
    "title": "Calendario Disponibilità | Balla Botond",
    "description": "Controlla la mia disponibilità per le prossime settimane. Visualizza quando sono disponibile o occupato senza vedere i dettagli degli eventi privati.",
    "keywords": "Balla Botond, calendario, disponibilità, programma, prenotazione, contatto",
    "tagline": "Quando Sono Disponibile",
    "subtitle": "Calendario Disponibilità",
    "week": "Settimana",
    "available": "Disponibile",
    "busy": "Occupato",
    "past": "Passato",
    "today": "Oggi",
    "noCalendars": "Configurazione calendario non trovata. Si prega di impostare la variabile d'ambiente PUBLIC_CALENDAR_URLS.",
    "privacyNote": "La tua privacy è importante - viene mostrato solo lo stato di disponibilità, nessun dettaglio dell'evento viene rivelato.",
    "timezoneNote": "Tutti gli orari sono in ora di Budapest (CET/CEST)",
    "swipeHint": "Scorri per navigare tra le settimane"
  },
  "projects": {
    "title": "Progetti | Balla Botond",
    "tagline": "Creato con Precisione",
    "subtitle": "Progetti e Collegamenti",
    "description": "Sforzi creativi, strumenti utili e luoghi per connettersi",
    "vortex": {
      "title": "Vortex Chat",
      "description": "Un'applicazione chat Android peer-to-peer che utilizza WebRTC per la comunicazione diretta. Messaggistica in tempo reale, sistema basato su stanze e compatibilità cross-platform con iOS. Costruita con pratiche moderne di sviluppo Android.",
      "button": "Dai un'occhiata"
    },
    "kki": {
      "title": "Calcolatore KKI",
      "description": "Un semplice calcolatore KKI che aiuta con i calcoli KKI.",
      "button": "Provalo"
    },
    "trackit": {
      "title": "TrackIt",
      "description": "Un'app di monitoraggio fitness per il controllo della salute.",
      "button": "Mettiti in contatto"
    },
    "finance": {
      "title": "Tracker Finanze Personali",
      "description": "Un'app di finanza personale sicura e self-hosted costruita con React e Cloudflare Workers. Tieni traccia dei tuoi conti, transazioni e visualizza analisi - tutto in esecuzione GRATUITAMENTE sull'infrastruttura di Cloudflare.",
      "button": "Vedi Repository"
    },
    "minecraft": {
      "title": "Server Minecraft",
      "description": "Server privato di sopravvivenza per amici con plugin personalizzati e una comunità accogliente, che è iniziato come test per verificare le capacità del mio \"giocattolo\" appena acquistato, ma ora parecchie persone hanno iniziato a giocarci. Funziona su un Raspberry Pi 5 su una rete domestica.",
      "button": "Copia IP Server"
    },
    "website": {
      "title": "Sito Web Personale",
      "description": "Questo sito web - un portfolio personale costruito con Astro, con un design moderno e supporto per l'internazionalizzazione. Mostra i miei progetti, curriculum e fornisce una piattaforma per connettersi.",
      "button": "Vedi Codice Sorgente"
    },
    "tarckit": {
      "title": "I Nostri Progetti di Gruppo",
      "description": "Pagina promozionale che presenta i progetti e le applicazioni innovative del nostro gruppo. Esplora il nostro lavoro collaborativo nel monitoraggio del fitness, tecnologia sanitaria e varie iniziative di sviluppo.",
      "button": "Visita il Sito"
    },
    "category": {
      "webapps": "App Web",
      "mobile": "App Mobile",
      "health": "Salute e Fitness",
      "gaming": "Giochi"
    },
    "status": {
      "live": "Online",
      "coming": "Prossimamente",
      "maintenance": "Manutenzione",
      "past": "Progetto Passato"
    }
  },
  "resume": {
    "title": "Curriculum | Balla Botond",
    "tagline": "Soluzioni Ponderate",
    "subtitle": "Curriculum Professionale",
    "position": "Studente di Informatica, Sviluppatore Software e Imprenditore",
    "summary": {
      "title": "Riassunto Professionale",
      "text": "Uno studente di Informatica orientato ai risultati con una passione per trasformare problemi complessi in eleganti soluzioni software. Completo le mie basi accademiche cercando attivamente progetti nel mondo reale, credendo che l'esperienza pratica sia la chiave per la vera maestria. Sono motivato dall'intero ciclo di vita dello sviluppo, dalla concettualizzazione di una funzionalità alla distribuzione di un prodotto funzionale e di alta qualità come un'applicazione web o un algoritmo efficiente. Sono un apprendista per tutta la vita, esplorando costantemente nuove tecnologie e framework per affinare le mie competenze di problem-solving."
    },
    "skills": {
      "title": "Competenze Tecniche",
      "programming": "Linguaggi di Programmazione",
      "frameworks": "Framework e Librerie",
      "tools": "Strumenti e Tecnologie"
    },
    "experience": {
      "title": "Esperienza Professionale",
      "current": "Sviluppatore Software",
      "current_period": "Luglio 2025 - Presente",
      "current_company": "LogiCloud KFT",
      "current_desc1": "Sviluppo soluzioni software per varie aziende, inclusa Suzuki, come sviluppatore part-time mentre proseguo gli studi universitari.",
      "current_desc2": "Contribuisco a progetti software di livello produttivo all'interno di un team di sviluppo specializzato.",
      "current_desc3": "Bilancio con successo l'esperienza di sviluppo professionale con le responsabilità accademiche.",
      "intern": "Tirocinante Sviluppo Software",
      "intern_period": "Maggio 2025 - Luglio 2025",
      "intern_company": "LogiCloud KFT",
      "intern_desc1": "Completato un programma di tirocinio intensivo di 8 settimane, contribuendo a progetti di sviluppo software per Suzuki e le sue aziende partner.",
      "intern_desc2": "Appreso standard di codifica professionale e flussi di lavoro di team in un ambiente di sviluppo piccolo e specializzato.",
      "intern_desc3": "Applicato con successo le conoscenze accademiche per risolvere sfide tecniche pratiche utilizzando strumenti del settore.",
      "wolt": "Ciclista Consegne",
      "wolt_period": "2023 - 2024",
      "wolt_company": "Wolt",
      "wolt_desc1": "Eseguito consegne puntuali e accurate in tutta la città in un ambiente dinamico e frenetico.",
      "wolt_desc2": "Padroneggiato l'ottimizzazione dei percorsi e la gestione del tempo per massimizzare l'efficienza e garantire un'elevata soddisfazione del cliente.",
      "wolt_desc3": "Sviluppato forti capacità di problem-solving e resilienza lavorando in autonomia sotto pressione.",
      "hotel": "Cameriere",
      "hotel_period": "Giugno 2022 - Luglio 2022",
      "hotel_company": "Hotel Piroska **** Bük",
      "hotel_desc1": "Fornito servizio eccezionale a una clientela diversificata e internazionale in un ambiente alberghiero a 4 stelle ad alto volume.",
      "hotel_desc2": "Gestito tutti gli aspetti del servizio di cibo e bevande, garantendo un'esperienza degli ospiti fluida e positiva.",
      "hotel_desc3": "Migliorato le competenze di comunicazione interculturale e affinato la capacità di esibirsi con grazia sotto pressione."
    },
    "education": {
      "title": "Istruzione",
      "university": "Laurea in Informatica",
      "university_period": "2023 - Presente",
      "university_school": "Università di Pécs",
      "university_desc1": "Perseguendo una laurea completa in Informatica con un curriculum focalizzato sull'ingegneria del software, strutture dati e algoritmi avanzati.",
      "university_desc2": "Attivamente coinvolto in lavori pratici e progetti che collegano la teoria con l'applicazione del mondo reale.",
      "highschool": "Diploma di Scuola Superiore",
      "highschool_period": "2019 - 2023",
      "highschool_school": "Árpád-házi Szent Erzsébet Gimnázium",
      "highschool_desc": "Diplomato con risultati eccellenti, stabilendo una solida base in matematica e pensiero analitico.",
      "grades": "Risultati Esame Finale:",
      "subjects": {
        "math": "Matematica",
        "english": "Inglese",
        "literature": "Letteratura Ungherese",
        "history": "Storia",
        "cs_basic": "Informatica (Base)",
        "cs_advanced": "Informatica (Avanzato)"
      }
    },
    "languages": {
      "title": "Lingue",
      "hungarian": "Ungherese",
      "hungarian_level": "Madrelingua",
      "english": "Inglese",
      "english_level": "C1 Certificato"
    },
    "hobbies": {
      "title": "Hobby e Interessi",
      "fencing": "Scherma",
      "clarinet": "Clarinetto",
      "growth": "Crescita Personale",
      "gym": "Palestra",
      "whisky": "Degustazione Whisky",
      "cigar": "Appassionato di Sigari",
      "camping": "Campeggio",
      "fishing": "Pesca"
    }
  },
  "footer": {
    "taglines": [
      "Soluzioni Strategiche",
      "Innovazione Consegnata",
      "Risultati Guidati dalla Tecnologia",
      "Costruire Futuri Migliori",
      "Eccellenza Digitale",
      "L'Esecuzione Conta",
      "Dalla Visione al Valore",
      "Innovazione Scalabile",
      "Impatto Attraverso la Tecnologia",
      "Soluzioni Che Funzionano"
    ],
    "navigate": "Naviga",
    "quote": {
      "text": "\"La qualità non è mai accidentale; è sempre il risultato di alta intenzione, sforzo sincero, direzione intelligente ed esecuzione abile.\"",
      "author": "William A. Foster"
    },
    "copyright": "© 2025 Balla Botond. Tutti i diritti riservati. | Creato con precisione e passione."
  }
}